#analyze and elaborate


analyze -f vhdl -lib WORK  ../src/HA.vhd
analyze -f vhdl -lib WORK  ../src/FA.vhd
analyze -f vhdl -lib WORK  ../src/RCA.vhd
analyze -f vhdl -lib WORK  ../src/dadda_tree.vhd
analyze -f vhdl -lib WORK  ../src/MBE.vhd
analyze -f vhdl -lib WORK ../src/packfp_packfp.vhd
analyze -f vhdl -lib WORK ../src/fpround_fpround.vhd
analyze -f vhdl -lib WORK ../src/fpnormalize_fpnormalize.vhd
analyze -f vhdl -lib WORK ../src/unpackfp_unpackfp.vhd
analyze -f vhdl -lib WORK ../src/fpmul_single_cycle.vhd
analyze -f vhdl -lib WORK ../src/fpmul_stage1_struct.vhd
analyze -f vhdl -lib WORK ../src/fpmul_stage2_struct_MBE.vhd
analyze -f vhdl -lib WORK ../src/fpmul_stage3_struct.vhd
analyze -f vhdl -lib WORK ../src/fpmul_stage4_struct.vhd
analyze -f vhdl -lib WORK ../src/fpmul_in_pipeline.vhd

set power_preserve_rtl_hier_names true
elaborate FPmul -arch pipeline -lib WORK > ./MBE/report_elaborate.txt



#creating clock and setting probabilities/capacitance

create_clock -name MY_CLK -period 0 clk
set_dont_touch_network MY_CLK

#set_clock_uncertainty 0.07 [get_clocks MY_CLK]
#set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] clk]
#set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
#set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
#set_load $OLOAD [all_outputs]

ungroup -all -flatten
#set_implementation DW02_mult/PPARCH I2/mult_134

#synthesizing
compile


##reports
#report_resources

#report_timing > report_timing_fdiv4.txt
#report_area > report_area_fdiv4.txt

#generating verilog netlist and files necessary for switching activity notation
#ungroup -all -flatten
#change_names -hierarchy -rules verilog
#write_sdf ../netlist/IIRfilter.sdf
#write -f verilog -hierarchy -output ../netlist/IIRfilter.v
#write_sdc ../netlist/IIRfilter.sdc
