read_verilog -netlist ../netlist/IIRfilter.v
read_saif -input ../saif/IIRfilter_syn.saif -instance tb_fir/IIR -unit ns -scale 1
create_clock -name MY_CLK CLK
report_power
