###################################################################

# Created by write_sdc on Sun Nov 21 12:14:45 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {DOUT[6]}]
set_load -pin_load 3.40189 [get_ports {DOUT[5]}]
set_load -pin_load 3.40189 [get_ports {DOUT[4]}]
set_load -pin_load 3.40189 [get_ports {DOUT[3]}]
set_load -pin_load 3.40189 [get_ports {DOUT[2]}]
set_load -pin_load 3.40189 [get_ports {DOUT[1]}]
set_load -pin_load 3.40189 [get_ports {DOUT[0]}]
set_load -pin_load 3.40189 [get_ports VOUT]
create_clock [get_ports CLK]  -name MY_CLK  -period 10.12  -waveform {0 5.06}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H1[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H1[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H1[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H1[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H1[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H1[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H1[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H2[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H2[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H2[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H2[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H2[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H2[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H2[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H3[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H3[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H3[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H3[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H3[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H3[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {H3[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports VIN]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST_n]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports VOUT]
