read_verilog -netlist ../netlist/IIRfilter_LA.v
read_saif -input ../saif/IIRfilter_syn_LA.saif -instance tb_fir/IIR -unit ns -scale 1
create_clock -name MY_CLK CLK
report_power
